package com.wqz.accuratetimingnext.act.about.data

/**
 * 版本更新日志
 * Created by Wu Qizhen on 2024.12.31
 */
object UpdateLogData {
    val updateLogs = listOf(
        UpdateLog(
            "✨ Acumen",
            "新的开始，敏锐、引人注目",
            "2024.10.24",
            """» 应用简介
 - ⌈精准时刻⌋ 是一款独特的计时游戏，旨在帮助玩家在游戏中实现精确的时间控制，让玩家在游戏中感受时间掌控的乐趣
» 功能特性
 - 随机生成：支持随机生成时间为玩家提供挑战
 - 秒表计时：玩家需要用秒表依次卡出对应时间，考验玩家的反应速度和准确性
 - 偏差计算：系统会计算玩家卡出的时间与所给时间的偏差，为玩家提供实时反馈
 - 分数计算：支持分数记录统计进行排行
 - 结果显示：游戏结束后，系统会显示玩家的最终分数，让玩家了解自己的表现
 - 多次挑战：玩家可以多次尝试，提高自己的成绩，不断挑战自己的极限
 - 界面简洁：游戏界面简洁易用，便于玩家快速上手
 - 难度可调：可以根据玩家的需求调整生成时间的范围，提高游戏的挑战性
 - 适应性强：无论玩家是新手还是高手，都能在这款游戏中找到适合自己的挑战难度
 - 休闲娱乐：这款游戏可以作为休闲娱乐活动，帮助玩家在紧张的生活中放松心情
 - 创意创新：这款游戏集成了多种创意创新元素，为玩家提供不同的游戏体验"""
        )
    )
}